solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_RSTCTL1.h
#define RSTCTL1_PRSTCTL0_SET_LP_FLEXCOMM20_MASK  (0x200U)
#define RSTCTL1_PRSTCTL0_SET_LP_FLEXCOMM20_SHIFT (9U)
/*! LP_FLEXCOMM20 - LP_FLEXCOMM20 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_LP_FLEXCOMM20(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_LP_FLEXCOMM20_SHIFT)) & RSTCTL1_PRSTCTL0_SET_LP_FLEXCOMM20_MASK)

#define RSTCTL1_PRSTCTL0_SET_SAI3_MASK           (0x400U)
#define RSTCTL1_PRSTCTL0_SET_SAI3_SHIFT          (10U)
/*! SAI3 - SAI3 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_SAI3(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_SAI3_SHIFT)) & RSTCTL1_PRSTCTL0_SET_SAI3_MASK)

#define RSTCTL1_PRSTCTL0_SET_I3C2_MASK           (0x800U)
#define RSTCTL1_PRSTCTL0_SET_I3C2_SHIFT          (11U)
/*! I3C2 - I3C2 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_I3C2(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_I3C2_SHIFT)) & RSTCTL1_PRSTCTL0_SET_I3C2_MASK)

#define RSTCTL1_PRSTCTL0_SET_I3C3_MASK           (0x1000U)
#define RSTCTL1_PRSTCTL0_SET_I3C3_SHIFT          (12U)
/*! I3C3 - I3C3 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_I3C3(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_I3C3_SHIFT)) & RSTCTL1_PRSTCTL0_SET_I3C3_MASK)

#define RSTCTL1_PRSTCTL0_SET_GPIO8_MASK          (0x2000U)
#define RSTCTL1_PRSTCTL0_SET_GPIO8_SHIFT         (13U)
/*! GPIO8 - GPIO8 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_GPIO8(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_GPIO8_SHIFT)) & RSTCTL1_PRSTCTL0_SET_GPIO8_MASK)

#define RSTCTL1_PRSTCTL0_SET_GPIO9_MASK          (0x4000U)
#define RSTCTL1_PRSTCTL0_SET_GPIO9_SHIFT         (14U)
/*! GPIO9 - GPIO9 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_GPIO9(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_GPIO9_SHIFT)) & RSTCTL1_PRSTCTL0_SET_GPIO9_MASK)

#define RSTCTL1_PRSTCTL0_SET_GPIO10_MASK         (0x8000U)
#define RSTCTL1_PRSTCTL0_SET_GPIO10_SHIFT        (15U)
/*! GPIO10 - GPIO10 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_GPIO10(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_GPIO10_SHIFT)) & RSTCTL1_PRSTCTL0_SET_GPIO10_MASK)

#define RSTCTL1_PRSTCTL0_SET_PINT1_MASK          (0x10000U)
#define RSTCTL1_PRSTCTL0_SET_PINT1_SHIFT         (16U)
/*! PINT1 - PINT1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_PINT1(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_PINT1_SHIFT)) & RSTCTL1_PRSTCTL0_SET_PINT1_MASK)

#define RSTCTL1_PRSTCTL0_SET_CTIMER5_MASK        (0x20000U)
#define RSTCTL1_PRSTCTL0_SET_CTIMER5_SHIFT       (17U)
/*! CTIMER5 - CTIMER5 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_CTIMER5(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_CTIMER5_SHIFT)) & RSTCTL1_PRSTCTL0_SET_CTIMER5_MASK)

#define RSTCTL1_PRSTCTL0_SET_CTIMER6_MASK        (0x40000U)
#define RSTCTL1_PRSTCTL0_SET_CTIMER6_SHIFT       (18U)
/*! CTIMER6 - CTIMER6 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_CTIMER6(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_CTIMER6_SHIFT)) & RSTCTL1_PRSTCTL0_SET_CTIMER6_MASK)

#define RSTCTL1_PRSTCTL0_SET_CTIMER7_MASK        (0x80000U)
#define RSTCTL1_PRSTCTL0_SET_CTIMER7_SHIFT       (19U)
/*! CTIMER7 - CTIMER7 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_CTIMER7(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_CTIMER7_SHIFT)) & RSTCTL1_PRSTCTL0_SET_CTIMER7_MASK)

#define RSTCTL1_PRSTCTL0_SET_MRT1_MASK           (0x100000U)
#define RSTCTL1_PRSTCTL0_SET_MRT1_SHIFT          (20U)
/*! MRT1 - MRT1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_MRT1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_MRT1_SHIFT)) & RSTCTL1_PRSTCTL0_SET_MRT1_MASK)

#define RSTCTL1_PRSTCTL0_SET_UTICK1_MASK         (0x200000U)
#define RSTCTL1_PRSTCTL0_SET_UTICK1_SHIFT        (21U)
/*! UTICK1 - UTICK1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_UTICK1(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_UTICK1_SHIFT)) & RSTCTL1_PRSTCTL0_SET_UTICK1_MASK)

#define RSTCTL1_PRSTCTL0_SET_MU3_MASK            (0x1000000U)
#define RSTCTL1_PRSTCTL0_SET_MU3_SHIFT           (24U)
/*! MU3 - MU3 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_MU3(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_MU3_SHIFT)) & RSTCTL1_PRSTCTL0_SET_MU3_MASK)

#define RSTCTL1_PRSTCTL0_SET_SEMA42_3_MASK       (0x2000000U)
#define RSTCTL1_PRSTCTL0_SET_SEMA42_3_SHIFT      (25U)
/*! SEMA42_3 - SEMA42_3 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_SEMA42_3(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_SEMA42_3_SHIFT)) & RSTCTL1_PRSTCTL0_SET_SEMA42_3_MASK)

#define RSTCTL1_PRSTCTL0_SET_PVT1_MASK           (0x10000000U)
#define RSTCTL1_PRSTCTL0_SET_PVT1_SHIFT          (28U)
/*! PVT1 - PVT1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL1_PRSTCTL0_SET_PVT1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_SET_PVT1_SHIFT)) & RSTCTL1_PRSTCTL0_SET_PVT1_MASK)
/*! @} */

/*! @name PRSTCTL0_CLR - Sense Domain Private Peripheral Reset Control 0 CLR */
/*! @{ */

#define RSTCTL1_PRSTCTL0_CLR_HIFI1_MASK          (0x2U)
#define RSTCTL1_PRSTCTL0_CLR_HIFI1_SHIFT         (1U)
/*! HiFi1 - HiFi1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_CLR_HIFI1(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_HIFI1_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_HIFI1_MASK)

#define RSTCTL1_PRSTCTL0_CLR_HIFI1_DEBUG_MASK    (0x4U)
#define RSTCTL1_PRSTCTL0_CLR_HIFI1_DEBUG_SHIFT   (2U)
/*! HiFi1_DEBUG - HiFi1 Debug Reset
 *  0b0..No effect.
 *  0b1..Clears reset
 */
#define RSTCTL1_PRSTCTL0_CLR_HIFI1_DEBUG(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_HIFI1_DEBUG_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_HIFI1_DEBUG_MASK)

#define RSTCTL1_PRSTCTL0_CLR_EDMA2_MASK          (0x10U)
#define RSTCTL1_PRSTCTL0_CLR_EDMA2_SHIFT         (4U)
/*! eDMA2 - eDMA2 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_CLR_EDMA2(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_EDMA2_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_EDMA2_MASK)

#define RSTCTL1_PRSTCTL0_CLR_EDMA3_MASK          (0x20U)
#define RSTCTL1_PRSTCTL0_CLR_EDMA3_SHIFT         (5U)
/*! eDMA3 - eDMA3 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_CLR_EDMA3(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_EDMA3_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_EDMA3_MASK)

#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM17_MASK  (0x40U)
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM17_SHIFT (6U)
/*! LP_FLEXCOMM17 - LP_FLEXCOMM17 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM17(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM17_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM17_MASK)

#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM18_MASK  (0x80U)
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM18_SHIFT (7U)
/*! LP_FLEXCOMM18 - LP_FLEXCOMM18 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM18(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM18_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM18_MASK)

#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM19_MASK  (0x100U)
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM19_SHIFT (8U)
/*! LP_FLEXCOMM19 - LP_FLEXCOMM19 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM19(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM19_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM19_MASK)

